// KQL Query checks for ASR blocks or audits and supplies filepath you can whitelist.

let ActionTypeLookup = datatable(ActionType:string , Name:string, GUID:string, State:string)[
"AsrVulnerableSignedDriverAudited", "Block abuse of exploited vulnerable signed drivers", "56a863a9-875e-4185-98a7-b882c64b5ce5", "Audited",
"AsrVulnerableSignedDriverBlocked", "Block abuse of exploited vulnerable signed drivers", "56a863a9-875e-4185-98a7-b882c64b5ce5", "Blocked",
"AsrAdobeReaderChildProcessAudited", "Block Adobe Reader from creating child processes", "7674ba52-37eb-4a4f-a9a1-f0f9a1619a2c", "Audited",
"AsrAdobeReaderChildProcessBlocked", "Block Adobe Reader from creating child processes", "7674ba52-37eb-4a4f-a9a1-f0f9a1619a2c", "Blocked",
"AsrOfficeChildProcessAudited", "Block all Office applications from creating child processes", "d4f940ab-401b-4efc-aadc-ad5f3c50688a", "Audited",
"AsrOfficeChildProcessBlocked", "Block all Office applications from creating child processes", "d4f940ab-401b-4efc-aadc-ad5f3c50688a", "Blocked",
"AsrLsassCredentialTheftAudited", "Block credential stealing from the Windows local security authority subsystem (lsass.exe)", "9e6c4e1f-7d60-472f-ba1a-a39ef669e4b2", "Audited",
"AsrLsassCredentialTheftBlocked", "Block credential stealing from the Windows local security authority subsystem (lsass.exe)", "9e6c4e1f-7d60-472f-ba1a-a39ef669e4b2", "Blocked",
"AsrExecutableEmailContentAudited", "Block executable content from email client and webmail", "be9ba2d9-53ea-4cdc-84e5-9b1eeee46550", "Audited",
"AsrExecutableEmailContentBlocked", "Block executable content from email client and webmail", "be9ba2d9-53ea-4cdc-84e5-9b1eeee46550", "Blocked",
"AsrUntrustedExecutableAudited", "Block executable files from running unless they meet a prevalence, age, or trusted list criterion", "01443614-cd74-433a-b99e-2ecdc07bfc25", "Audited",
"AsrUntrustedExecutableBlocked", "Block executable files from running unless they meet a prevalence, age, or trusted list criterion", "01443614-cd74-433a-b99e-2ecdc07bfc25", "Blocked",
"AsrObfuscatedScriptAudited", "Block execution of potentially obfuscated scripts", "5beb7efe-fd9a-4556-801d-275e5ffc04cc", "Audited",
"AsrObfuscatedScriptBlocked", "Block execution of potentially obfuscated scripts", "5beb7efe-fd9a-4556-801d-275e5ffc04cc", "Blocked",
"AsrScriptExecutableDownloadAudited", "Block JavaScript or VBScript from launching downloaded executable content", "d3e037e1-3eb8-44c8-a917-57927947596d", "Audited",
"AsrScriptExecutableDownloadBlocked", "Block JavaScript or VBScript from launching downloaded executable content", "d3e037e1-3eb8-44c8-a917-57927947596d", "Blocked",
"AsrExecutableOfficeContentAudited", "Block Office applications from creating executable content", "3b576869-a4ec-4529-8536-b80a7769e899", "Audited",
"AsrExecutableOfficeContentBlocked", "Block Office applications from creating executable content", "3b576869-a4ec-4529-8536-b80a7769e899", "Blocked",
"AsrOfficeProcessInjectionAudited", "Block Office applications from injecting code into other processes", "75668c1f-73b5-4cf0-bb93-3ecf5cb7cc84", "Audited",
"AsrOfficeProcessInjectionBlocked", "Block Office applications from injecting code into other processes", "75668c1f-73b5-4cf0-bb93-3ecf5cb7cc84", "Blocked",
"AsrOfficeCommAppChildProcessAudited", "Block Office communication application from creating child processes", "26190899-1602-49e8-8b27-eb1d0a1ce869", "Audited",
"AsrOfficeCommAppChildProcessBlocked", "Block Office communication application from creating child processes", "26190899-1602-49e8-8b27-eb1d0a1ce869", "Blocked",
"AsrPersistenceThroughWmiAudited", "Block persistence through WMI event subscription", "e6db77e5-3df2-4cf1-b95a-636979351e5b", "Audited",
"AsrPersistenceThroughWmiBlocked", "Block persistence through WMI event subscription", "e6db77e5-3df2-4cf1-b95a-636979351e5b", "Blocked",
"AsrPsexecWmiChildProcessAudited", "Block process creations originating from PSExec and WMI commands", "d1e49aac-8f56-4280-b9ba-993a6d77406c", "Audited",
"AsrPsexecWmiChildProcessBlocked", "Block process creations originating from PSExec and WMI commands", "d1e49aac-8f56-4280-b9ba-993a6d77406c", "Blocked",
"", "Block rebooting machine in Safe Mode (preview)", "33ddedf1-c6e0-47cb-833e-de6133960387", "Audited",
"", "Block rebooting machine in Safe Mode (preview)", "33ddedf1-c6e0-47cb-833e-de6133960387", "Blocked",
"AsrUntrustedUsbProcessAudited", "Block untrusted and unsigned processes that run from USB", "b2b3f03d-6a65-4f7b-a9c7-1c7ef74a9ba4", "Audited",
"AsrUntrustedUsbProcessBlocked", "Block untrusted and unsigned processes that run from USB", "b2b3f03d-6a65-4f7b-a9c7-1c7ef74a9ba4", "Blocked",
"", "Block use of copied or impersonated system tools (preview)", "c0033c00-d16d-4114-a5a0-dc9b3a7d2ceb", "Audited",
"", "Block use of copied or impersonated system tools (preview)", "c0033c00-d16d-4114-a5a0-dc9b3a7d2ceb", "Blocked",
"", "Block Webshell creation for Servers", "a8f5898e-1dc8-49a9-9878-85004b8a61e6", "Audited",
"", "Block Webshell creation for Servers", "a8f5898e-1dc8-49a9-9878-85004b8a61e6", "Blocked",
"AsrOfficeMacroWin32ApiCallsAudited", "Block Win32 API calls from Office macros", "92e97fa1-2edf-4476-bdd6-9dd0b4dddc7b", "Audited",
"AsrOfficeMacroWin32ApiCallsBlocked", "Block Win32 API calls from Office macros", "92e97fa1-2edf-4476-bdd6-9dd0b4dddc7b", "Blocked",
"AsrRansomwareAudited", "Use advanced protection against ransomware", "c1db55ab-c21a-4637-bb3f-a12568109d35", "Audited",
"AsrRansomwareBlocked", "Use advanced protection against ransomware", "c1db55ab-c21a-4637-bb3f-a12568109d35", "Blocked"
];
DeviceEvents
| extend Exclusion = strcat(FolderPath, @"\", FileName)
| project-keep Timestamp, Exclusion, SHA1, ActionType, InitiatingProcessFileName, DeviceId, DeviceName, InitiatingProcessAccountName, AdditionalFields, ProcessCommandLine
| extend AF = parse_json(AdditionalFields)
| extend GUID = tostring(AF.RuleId)
| extend State = iif(AF.IsAudit == true, "Audited", "Blocked")
| lookup kind=inner ActionTypeLookup on GUID, State
| project-away ActionType1
| sort by Timestamp desc
